package com.arms.api.alm.issue.base.service.jiraissue_schedule.alm_entity_sync;

import static com.arms.config.ApplicationContextProvider.*;

import com.arms.api.alm.issue.base.model.vo.지라이슈_벌크_추가_요청;
import com.arms.api.alm.issue.base.service.jiraissue.지라이슈_서비스_프로세스;
import com.arms.api.alm.issue.base.service.jiraissue_schedule.alm_streategy.이슈전략_호출;

public class ALM_수집_데이터_지라이슈_엔티티_동기화_팩토리 {

	public static ALM_수집_데이터_지라이슈_엔티티_동기화  ALM_수집_데이터_지라이슈_엔티티_동기화_생성(지라이슈_벌크_추가_요청 지라이슈_벌크_추가_요청값){

		ALM_수집_데이터_지라이슈_엔티티_동기화 alm_수집_데이터_지라이슈_엔티티_동기화
			= new ALM_수집_데이터_지라이슈_엔티티_동기화(
					지라이슈_벌크_추가_요청값
					, getBean(이슈전략_호출.class).서브테스크_가져오기(지라이슈_벌크_추가_요청값)
					, getBean(이슈전략_호출.class).이슈링크_가져오기(지라이슈_벌크_추가_요청값)
			);

		if(alm_수집_데이터_지라이슈_엔티티_동기화.가져온_ALM_이슈_없음()){
			/**
			 * ALM 서버 조회 후 반환된 데이터가 Null -> 1. 삭제되어 조회가 안 되는 경우 2. 서버에서 에러가 터진 경우
			 * ES 데이터에 있는지 조회 후 암스에서 관리하지 않는 요구사항으로 처리하는 로직
			 **/

			// ES에도 해당 정보가 없는 경우
			alm_수집_데이터_지라이슈_엔티티_동기화.지라이슈_요구사항_연결_끊고_삭제_적용(
				getBean(지라이슈_서비스_프로세스.class).이슈_조회하기(지라이슈_벌크_추가_요청값.조회조건_아이디())
			);
			// 하위이슈의 경우 요구사항 이슈가 삭제되었을 때 전부 삭제된다(모든 도큐먼트에 삭제 flag 추가)
			alm_수집_데이터_지라이슈_엔티티_동기화.지라이슈_일괄_삭제_적용();
		}else {
			// 삭제된 하위이슈 flag 처리
			alm_수집_데이터_지라이슈_엔티티_동기화.지라이슈_데이터에_존재하지_않는_지라이슈_엔티티_삭제_적용();

			alm_수집_데이터_지라이슈_엔티티_동기화.지라이슈_엔티티_요구사항_적용();

			alm_수집_데이터_지라이슈_엔티티_동기화.지라이슈_엔티티_하위이슈_목록_적용();

			alm_수집_데이터_지라이슈_엔티티_동기화.지라이슈_엔티티_연결이슈_적용();
		}

		return alm_수집_데이터_지라이슈_엔티티_동기화;

	}

	public static ALM_수집_데이터_지라이슈_엔티티_동기화 ALM_수집_데이터_증분_지라이슈_엔티티_동기화_생성(지라이슈_벌크_추가_요청 지라이슈_벌크_추가_요청값){

		ALM_수집_데이터_지라이슈_엔티티_동기화 alm_수집_데이터_증분_지라이슈_엔티티_동기화
			= new ALM_수집_데이터_지라이슈_엔티티_동기화(
				지라이슈_벌크_추가_요청값
				, getBean(이슈전략_호출.class).증분서브테스크_가져오기(지라이슈_벌크_추가_요청값)
				, getBean(이슈전략_호출.class).증분이슈링크_가져오기(지라이슈_벌크_추가_요청값)
			);

		if (alm_수집_데이터_증분_지라이슈_엔티티_동기화.가져온_ALM_이슈_없음()) {

			/**
			 * ALM 서버 조회 후 반환된 데이터가 Null -> 1. 삭제되어 조회가 안 되는 경우 2. 서버에서 에러가 터진 경우
			 * ES 데이터에 있는지 조회 후 암스에서 관리하지 않는 요구사항으로 처리하는 로직
			 **/

			// ES에도 해당 정보가 없는 경우
			alm_수집_데이터_증분_지라이슈_엔티티_동기화.지라이슈_요구사항_연결_끊고_삭제_적용(
				getBean(지라이슈_서비스_프로세스.class).이슈_조회하기(지라이슈_벌크_추가_요청값.조회조건_아이디())
			);

			// 하위이슈의 경우 요구사항 이슈가 삭제되었을 때 전부 삭제된다(모든 도큐먼트에 삭제 flag 추가)
			alm_수집_데이터_증분_지라이슈_엔티티_동기화.지라이슈_일괄_삭제_적용();

		}else{

			// 삭제된 하위이슈 flag 처리
			alm_수집_데이터_증분_지라이슈_엔티티_동기화.지라이슈_데이터에_존재하지_않는_지라이슈_엔티티_삭제_적용();

			alm_수집_데이터_증분_지라이슈_엔티티_동기화.증분_지라이슈_엔티티_요구사항_적용();

			alm_수집_데이터_증분_지라이슈_엔티티_동기화.지라이슈_엔티티_하위이슈_목록_적용();

			alm_수집_데이터_증분_지라이슈_엔티티_동기화.지라이슈_엔티티_연결이슈_적용();
		}

		return alm_수집_데이터_증분_지라이슈_엔티티_동기화;

	}
}
